# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Binaries
brew 'bash'
brew 'bat'
brew 'curl'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mas'
brew 'pkg-config'
brew 'tree'
brew 'vim'
brew 'zsh'

# Development
brew 'imagick'
brew 'mariadb'
brew 'mas'
brew 'nginx'
brew 'node'
brew 'n'
brew 'php'
brew 'redis'

# Applications
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'backblaze'
cask 'background-music'
cask 'cheatsheet'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hyperswitch'
cask 'imageoptim'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'kap'
cask 'karabiner-elements'
cask 'omnidisksweeper'
# cask 'phpstorm' --- install via jetbrains-toolbox
cask 'pock'
cask 'postman'
cask 'sequel-pro'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'viscosity'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-fira-code' 		# https://github.com/tonsky/FiraCode
cask 'font-source-code-pro'	# https://github.com/adobe-fonts/source-code-pro

# Mac App Store Applications
mas 'amphetamine', id: 937984704
mas 'bear', id: 1091189122
