# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Binaries
brew 'bash'
brew 'bat'
brew 'brew-php-switcher'
brew 'curl'
brew 'git'
brew 'gnupg2'
brew 'go'
brew 'grep'
brew 'imagemagick'
brew 'mariadb'
brew 'mas'
brew 'n'
brew 'nginx'
brew 'php'
brew 'pkg-config'
brew 'redis'
brew 'svn' # Necessary for other packages/fonts. Don't at me.
brew 'tree'
brew 'vim'
brew 'zsh'

# Applications
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'backblaze'
cask 'docker'
cask 'gpg-suite'
cask 'imageoptim'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'kap'
# cask 'phpstorm' --- install via jetbrains-toolbox
cask 'rectangle'
cask 'sequel-ace'
cask 'slack'
cask 'smooze'
cask 'spotify'
cask 'viscosity'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-fira-code' 		# https://github.com/tonsky/FiraCode
cask 'font-source-code-pro'	# https://github.com/adobe-fonts/source-code-pro

# Mac App Store Applications
mas 'Bear', id: 1091189122
mas 'Things', id: 904280696
mas 'Hush', id: 1544743900
mas 'Hidden Bar', id: 1452453066
mas 'Day One', id: 1055511498
